<a href="https://colab.research.google.com/github/jackqk/pandas-note/blob/master/DataFrame_Method.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **DataFrame Method**

# **Group**

In [1]:
import pandas as pd
import numpy as np
scores = pd.DataFrame({
    'name':['Adam', 'Bob', 'Dave', 'Fred'],
    'age': [15, 16, 16, 15],
    'test1': [95, 81, 89, None],
    'test2': [80, 82, 84, 88],
    'teacher': ['Ashby', 'Ashby', 'Jones', 'Jones']})
scores

   name  age  test1  test2 teacher
0  Adam   15   95.0     80   Ashby
1   Bob   16   81.0     82   Ashby
2  Dave   16   89.0     84   Jones
3  Fred   15    NaN     88   Jones

In [2]:
# group by teacher, then invoke median
# 即相同的teacher name为条件进行分组
scores.groupby('teacher').median()

          age  test1  test2
teacher
Ashby    15.5   88.0   81.0
Jones    15.5   89.0   86.0

In [3]:
# group by 'teacher' and 'age', then invoke min, max
scores.groupby(['teacher', 'age']).agg([min, max])

             name       test1       test2
              min   max   min   max   min max
teacher age
Ashby   15   Adam  Adam  95.0  95.0    80  80
        16    Bob   Bob  81.0  81.0    82  82
Jones   15   Fred  Fred   NaN   NaN    88  88
        16   Dave  Dave  89.0  89.0    84  84

# **Pivot Table**

In [4]:
import pandas as pd
import numpy as np
scores = pd.DataFrame({
    'name':['Adam', 'Bob', 'Dave', 'Fred'],
    'age': [15, 16, 16, 15],
    'test1': [95, 81, 89, None],
    'test2': [80, 82, 84, 88],
    'teacher': ['Ashby', 'Ashby', 'Jones', 'Jones']})
scores

   name  age  test1  test2 teacher
0  Adam   15   95.0     80   Ashby
1   Bob   16   81.0     82   Ashby
2  Dave   16   89.0     84   Jones
3  Fred   15    NaN     88   Jones

In [5]:
# 先根据teacher分组，再根据test1, test2字段进行median
scores.pivot_table(index='teacher', values=['test1', 'test2'], aggfunc='median')

         test1  test2
teacher
Ashby     88.0     81
Jones     89.0     86

In [6]:
# 先根据teacher, age分组，再根据test1, test2字段进行median
scores.pivot_table(index=['teacher', 'age'], values=['test1', 'test2'], aggfunc='median')

             test1  test2
teacher age
Ashby   15    95.0     80
        16    81.0     82
Jones   15     NaN     88
        16    89.0     84

In [7]:
# 先根据teacher, age分组，再根据test1, test2字段进行min, max
scores.pivot_table(index='teacher', values=['test1', 'test2'], aggfunc=[min, max])

          min         max
        test1 test2 test1 test2
teacher
Ashby    81.0    80  95.0    82
Jones    89.0    84  89.0    88

In [8]:
# 在前面的基础上，加个汇总信息
scores.pivot_table(index='teacher', values=['test1', 'test2'], aggfunc='median', margins=True)

         test1  test2
teacher
Ashby     88.0     81
Jones     89.0     86
All       89.0     82

In [9]:
# 以teacher, age两个特征进行分组，然后再test1， test2字段进行len、sum统计
scores.pivot_table(index=['teacher', 'age'], values=['test1', 'test2'], aggfunc=[len, sum], margins=True, dropna=False)

              len         sum
            test1 test2 test1 test2
teacher age
Ashby   15    1.0     1  95.0    80
        16    1.0     1  81.0    82
Jones   15    1.0     1   0.0    88
        16    1.0     1  89.0    84
All           4.0     4   NaN   334

# **Reshape**

## Melting Data

In [10]:
import pandas as pd
import numpy as np
scores = pd.DataFrame({
    'name':['Adam', 'Bob', 'Dave', 'Fred'],
    'age': [15, 16, 16, 15],
    'test1': [95, 81, 89, None],
    'test2': [80, 82, 84, 88],
    'teacher': ['Ashby', 'Ashby', 'Jones', 'Jones']})
scores

   name  age  test1  test2 teacher
0  Adam   15   95.0     80   Ashby
1   Bob   16   81.0     82   Ashby
2  Dave   16   89.0     84   Jones
3  Fred   15    NaN     88   Jones

In [11]:
pd.melt(scores, id_vars=['name', 'age'], value_vars=['test1', 'test2'])

   name  age variable  value
0  Adam   15    test1   95.0
1   Bob   16    test1   81.0
2  Dave   16    test1   89.0
3  Fred   15    test1    NaN
4  Adam   15    test2   80.0
5   Bob   16    test2   82.0
6  Dave   16    test2   84.0
7  Fred   15    test2   88.0

In [12]:
pd.melt(scores, id_vars=['name', 'age'], value_vars=['test1', 'test2'], var_name='test', value_name='score')

   name  age   test  score
0  Adam   15  test1   95.0
1   Bob   16  test1   81.0
2  Dave   16  test1   89.0
3  Fred   15  test1    NaN
4  Adam   15  test2   80.0
5   Bob   16  test2   82.0
6  Dave   16  test2   84.0
7  Fred   15  test2   88.0

### Demo：

In [13]:
# melt回到原来的数据
long_df = pd.melt(scores, id_vars=['name', 'age'], value_vars=['test1', 'test2'], var_name='test', value_name='score')
long_df

   name  age   test  score
0  Adam   15  test1   95.0
1   Bob   16  test1   81.0
2  Dave   16  test1   89.0
3  Fred   15  test1    NaN
4  Adam   15  test2   80.0
5   Bob   16  test2   82.0
6  Dave   16  test2   84.0
7  Fred   15  test2   88.0

In [14]:
# 这种手法之所以能还原，是因为name、和age、与test1、test2，组成唯一，若你再加入一条一模一样的行，就不行了。
wide_df = long_df.pivot_table(index=['name', 'age'], columns=['test'], values=['score'])
wide_df

         score
test     test1 test2
name age
Adam 15   95.0  80.0
Bob  16   81.0  82.0
Dave 16   89.0  84.0
Fred 15    NaN  88.0

In [15]:
wide_df = wide_df.reset_index()
wide_df

      name age score
test           test1 test2
0     Adam  15  95.0  80.0
1      Bob  16  81.0  82.0
2     Dave  16  89.0  84.0
3     Fred  15   NaN  88.0

In [16]:
cols = wide_df.columns
cols.get_level_values(0)

Index(['name', 'age', 'score', 'score'], dtype='object')

In [17]:
cols.get_level_values(1)

Index(['', '', 'test1', 'test2'], dtype='object', name='test')

In [18]:
l1 = cols.get_level_values(1)
l0 = cols.get_level_values(0)
names = [x[1] if x[1] else x[0] for x in zip(l0, l1)]
names

['name', 'age', 'test1', 'test2']

In [19]:
wide_df.columns = names
wide_df

   name  age  test1  test2
0  Adam   15   95.0   80.0
1   Bob   16   81.0   82.0
2  Dave   16   89.0   84.0
3  Fred   15    NaN   88.0

## Dummy Variables

In [20]:
import pandas as pd
import numpy as np
scores = pd.DataFrame({
    'name':['Adam', 'Bob', 'Dave', 'Fred'],
    'age': [15, 16, 16, 15],
    'test1': [95, 81, 89, None],
    'test2': [80, 82, 84, 88],
    'teacher': ['Ashby', 'Ashby', 'Jones', 'Jones']})
scores

   name  age  test1  test2 teacher
0  Adam   15   95.0     80   Ashby
1   Bob   16   81.0     82   Ashby
2  Dave   16   89.0     84   Jones
3  Fred   15    NaN     88   Jones

In [21]:
# create dummy by age
age_dummy = pd.get_dummies(scores, columns=['age'], prefix='age')
age_dummy

   name  test1  test2 teacher  age_15  age_16
0  Adam   95.0     80   Ashby       1       0
1   Bob   81.0     82   Ashby       0       1
2  Dave   89.0     84   Jones       0       1
3  Fred    NaN     88   Jones       1       0

In [34]:
# Undoing Dummy Var
def get_index(vals):
  return list(vals).index(1)

''' df - dataframe with dummy columns
	prefix - prefix of dummy columns
	new_col_name - column name to replace dummy columns
	val_type - callable type for new column
'''
def undummy(df, prefix, new_col_name, val_type=float):
	dummy_cols = [col for col in df.columns if col.startswith(prefix)]
	# map of index location of dummy variable to new value
	idx2val = {i:val_type(col[len(prefix):]) for i, col
	in enumerate(dummy_cols)}
	
	# using the dummy_cols lookup the new value by idx
	ser = df[dummy_cols].apply(
	lambda x: idx2val.get(get_index(x), None), axis=1)
	df[new_col_name] = ser
	df = df.drop(dummy_cols, axis=1)
	return df
undummy(age_dummy, 'age_', 'age')

   name  test1  test2 teacher   age
0  Adam   95.0     80   Ashby  15.0
1   Bob   81.0     82   Ashby  16.0
2  Dave   89.0     84   Jones  16.0
3  Fred    NaN     88   Jones  15.0

# **统计**

In [0]:
import pandas as pd
url = 'https://raw.githubusercontent.com/jackqk/pandas-note/master/data/tlocation.csv'
df = pd.read_csv(url)
df.head()

## describe

In [0]:
# 大概看一下，注意year因为是字符串，所以默认不会显示
df.describe()

In [0]:
# 全部显示
df.describe(include='all')

In [0]:
#中位数，就是describe中50%
df.quantile()

In [0]:
df.quantile(q=[0.1, 0.9])

## count、value_count

In [0]:
# 返回个数：所有非NaN
df.count()

In [0]:
# 因为year是字符串，所以用value_counts()查看是否有重复
df['year'].value_counts()

## rank

In [0]:
# 给每一列都中的元素，都编上个序号
df.rank()

In [0]:
df.rank(ascending=False)

In [0]:
# 参数有average、min、max、first、dense
df.rank(method='min')

## Correlation and Covariance

In [0]:
# Pearson Correlation Coefficient
# 越接近1越相关，越接近-1越不想关
df.corr()

In [0]:
df.corr(method='spearman')

In [0]:
# dataframe之间相关性比较
df2 = df[['inches']] - 100
df.corrwith(df2)

In [0]:
# pair-wise covariance
df.cov()

## Reductions
collapse comluns into a single value

In [0]:
# sum
print(df.sum())
print()

# sum numeric only
df.sum(numeric_only=True)

In [0]:
# multiple
df.prod()

In [0]:
# 平均数
print(df.mean())
print()
print(df.mean(axis=1))

In [0]:
# variance
df.var()

In [0]:
# mad
df.mad()

In [0]:
# skew
df.skew()

In [0]:
# kurt
df.kurt()

In [0]:
# df.idxmax() #报错
df[['year', 'inches']].idxmax()

# **Plotting**

In [0]:
import pandas as pd
import matplotlib.pyplot as plt
url = 'https://raw.githubusercontent.com/jackqk/pandas-note/master/data/sample1.csv'
df = pd.read_csv(url)
df

In [0]:
fig = plt.figure()
df.plot()
fig.savefig('/tmp/ex1.png')

In [0]:
# 上图MILES看上去几乎为0，改善一下
fig = plt.figure()
ax = fig.add_subplot(111)
df[['CUMUL', 'ELEVATION']].plot(ax=ax)
df['MILES'].plot(secondary_y=True)
plt.legend(loc='best')
ax.set_ylabel('Elvation (feet)')
ax.right_ax.set_ylabel('Distance(miles)')
fig.savefig('/tmp/ex3.png')

In [0]:
fig = plt.figure()
ax = fig.add_subplot(111)
df.plot(x='LOCATION', y=['ELEVATION', 'CUMUL'], ax=ax)
df.plot(x='LOCATION', y='MILES', secondary_y=True, ax=ax)
ax.set_ylabel('Elevation (feet)')
ax.right_ax.set_ylabel('Distance (miles)')
fig.autofmt_xdate()
fig.savefig('/tmp/df-ex4.png', bbox_inches='tight')

In [0]:
fig = plt.figure()
ax = fig.add_subplot(111)
df.plot(x='MILES', y=['ELEVATION', 'CUMUL'], ax=ax)
plt.legend(loc='best')
ax.set_ylabel('Elevation (feet)')